[
  {
    "id": "W001",
    "priority": 1,
    "category": "foundation",
    "description": "Build storefront shell with routing, session handling, and API client baseline",
    "steps": [
      "Define app layout and route skeleton",
      "Implement login state persistence and route guard",
      "Create shared API request wrapper and error normalization"
    ],
    "passes": true,
    "evidence": "Implemented shell routes, session persistence, API client and route guards; router guard tests passed via node.",
    "updated_at": "2026-02-27T05:49:56Z",
    "notes": "Acceptance: app shell runs and protected routes enforce login. Dependencies: A001."
  },
  {
    "id": "W002",
    "priority": 2,
    "category": "catalog",
    "description": "Implement product list, filter, sort, and product detail pages",
    "steps": [
      "Render category and product listing with pagination",
      "Support basic filter and sort conditions",
      "Render product detail with price and stock status"
    ],
    "passes": true,
    "notes": "商品列表支持关键词、分类、库存筛选及多维排序，详情页显示价格与库存状态。",
    "evidence": "已实现商品列表筛选/排序/分页与商品详情展示，router_guard_test 与 catalog_logic_test 均通过。",
    "updated_at": "2026-02-27T08:59:31Z"
  },
  {
    "id": "W003",
    "priority": 3,
    "category": "cart",
    "description": "Implement cart and checkout pages connected to server-side cart and pricing APIs",
    "steps": [
      "Support add to cart and quantity adjustment",
      "Show per-item and aggregate pricing breakdown",
      "Allow address selection before placing order"
    ],
    "passes": false,
    "notes": "Acceptance: shopper can reach checkout with accurate totals. Dependencies: W002, A003, A004."
  },
  {
    "id": "W004",
    "priority": 4,
    "category": "order",
    "description": "Implement order submit, payment initiation, and payment result flow",
    "steps": [
      "Create order submit action from checkout page",
      "Display payment redirect or QR flow",
      "Render success and failure status pages with retry entry"
    ],
    "passes": false,
    "notes": "Acceptance: shopper can place an order and see payment outcome. Dependencies: W003, A005, A006."
  },
  {
    "id": "W005",
    "priority": 5,
    "category": "account",
    "description": "Implement user center pages for order history, order detail, and refund requests",
    "steps": [
      "Render paginated order list with status filters",
      "Render order detail with shipment and timeline",
      "Provide refund apply form and status display"
    ],
    "passes": false,
    "notes": "Acceptance: user can self-serve order and refund queries. Dependencies: W004, A007."
  },
  {
    "id": "W006",
    "priority": 6,
    "category": "resilience",
    "description": "Implement robust loading, retry, and failure-state UX for critical checkout flows",
    "steps": [
      "Add skeleton and pending states for async requests",
      "Add recoverable retry patterns for transient failures",
      "Provide actionable fallback UI for non-recoverable errors"
    ],
    "passes": false,
    "notes": "Acceptance: critical pages remain usable during transient API failures. Dependencies: W003, W004."
  },
  {
    "id": "W007",
    "priority": 7,
    "category": "quality",
    "description": "Improve frontend performance and accessibility for the top purchase journey",
    "steps": [
      "Measure and optimize first contentful render for home and detail pages",
      "Ensure keyboard navigation and form labels for checkout",
      "Add bundle and runtime budget checks"
    ],
    "passes": false,
    "notes": "Acceptance: target page budgets and basic accessibility checks pass. Dependencies: W002, W003."
  },
  {
    "id": "W008",
    "priority": 8,
    "category": "verification",
    "description": "Add end-to-end smoke tests covering browse, add to cart, order submit, and order query",
    "steps": [
      "Create test seed strategy for deterministic data",
      "Implement smoke scenarios for main customer journey",
      "Integrate smoke tests into CI gate"
    ],
    "passes": false,
    "notes": "Acceptance: one-click smoke suite validates MVP flow on each release candidate. Dependencies: W004, W005, I005."
  }
]
